# Basic Handling of Python (BHP) and Its Methods

## Introduction :
Basic Handling of Python (BHP) refers to the fundamental operations performed using Python to handle, clean, and analyze data efficiently.  
These methods are widely used in data analysis to understand the dataset, handle missing values, filter data, and perform basic visualizations before applying advanced techniques.

## Libraries Used

- **Pandas**: Used for data manipulation and analysis.
- **NumPy**: Used for numerical operations.
- **Matplotlib**: Used for data visualization.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Creating a Sample Dataset

To explain the Basic Handling of Python (BHP) methods, a small sample dataset is created manually.  
This dataset contains basic student-related information such as name, age, marks, and city.

In [6]:
data = {
    'Name': ['Amit', 'Sneha', 'Rahul', 'Priya', 'Karan', 'Neha', 'Rohit', 'Anjali'],
    'Age': [22, 21, 23, 22, 24, 21, 23, 22],
    'Marks': [85, 90, 78, 88, 82, 91, 76, 89],
    'City': ['Pune', 'Mumbai', 'Pune', 'Delhi', 'Mumbai', 'Pune', 'Delhi', 'Mumbai']
}

df = pd.DataFrame(data)
df

     Name  Age  Marks    City
0    Amit   22     85    Pune
1   Sneha   21     90  Mumbai
2   Rahul   23     78    Pune
3   Priya   22     88   Delhi
4   Karan   24     82  Mumbai
5    Neha   21     91    Pune
6   Rohit   23     76   Delhi
7  Anjali   22     89  Mumbai

## Viewing the Dataset

### 1. head() Method
The `head()` method is used to display the first few rows of the dataset.  
It helps us understand how the data looks.

In [7]:
df.head()

    Name  Age  Marks    City
0   Amit   22     85    Pune
1  Sneha   21     90  Mumbai
2  Rahul   23     78    Pune
3  Priya   22     88   Delhi
4  Karan   24     82  Mumbai

### 2. tail() Method
The `tail()` method is used to display the last few rows of the dataset.  
It helps in checking the ending records of the data.

In [8]:
df.tail()

     Name  Age  Marks    City
3   Priya   22     88   Delhi
4   Karan   24     82  Mumbai
5    Neha   21     91    Pune
6   Rohit   23     76   Delhi
7  Anjali   22     89  Mumbai

## Selecting Data

### 1. Selecting a Single Column
We can select a single column from the dataset using the column name.  
This is useful when we want to work with only one specific variable.

In [9]:
df['Marks']

0    85
1    90
2    78
3    88
4    82
5    91
6    76
7    89
Name: Marks, dtype: int64

### 2. Selecting Multiple Columns
Multiple columns can be selected by passing a list of column names.  
This helps in viewing or analysing related data together.

In [10]:
df[['Name', 'Marks']]

     Name  Marks
0    Amit     85
1   Sneha     90
2   Rahul     78
3   Priya     88
4   Karan     82
5    Neha     91
6   Rohit     76
7  Anjali     89

### 3. Selecting Rows Using iloc
The `iloc` method is used to select rows based on their index position.

In [11]:
df.iloc[0:3]

    Name  Age  Marks    City
0   Amit   22     85    Pune
1  Sneha   21     90  Mumbai
2  Rahul   23     78    Pune

### 4. Selecting Data Using Condition
Data can be selected based on a condition.  
This helps in filtering the required records.

In [12]:
df[df['Marks'] > 85]

     Name  Age  Marks    City
1   Sneha   21     90  Mumbai
3   Priya   22     88   Delhi
5    Neha   21     91    Pune
7  Anjali   22     89  Mumbai

## Understanding Dataset Shape and Type

The shape and type of the dataset help us understand its size and structure.

In [13]:
df.shape

(8, 4)

In [14]:
type(df)

pandas.core.frame.DataFrame

## Selecting Data Using loc

The `loc` method is used to select data using row labels and column names.

In [15]:
df.loc[0, 'Name']

'Amit'

In [16]:
df.loc[0:3, ['Name', 'Marks']]

    Name  Marks
0   Amit     85
1  Sneha     90
2  Rahul     78
3  Priya     88

## Basic Statistical Functions

Statistical functions are used to understand the overall performance of the data.

In [17]:
df['Marks'].mean()

np.float64(84.875)

In [18]:
df['Marks'].median()

86.5

In [19]:
df['Marks'].mode()

0    76
1    78
2    82
3    85
4    88
5    89
6    90
7    91
Name: Marks, dtype: int64

## Conclusion

In this project, basic handling of Python using Pandas was performed.  
Various basic operations such as creating a DataFrame, viewing data, selecting rows and columns, applying conditions, and using simple statistical functions were performed.

This project helps in understanding how Python and Pandas are used for basic data handling and analysis.